#include <iostream>
using namespace std;

int main() {
    char letter;
    cout << "Введіть першу літеру назви країни: ";
    cin >> letter;

    switch (toupper(letter)) {
        case 'A':
            cout << "Австралія\nСтолиця: Канберра\nЧисельність населення: ~25 мільйонів\n";
            break;
        case 'B':
            cout << "Бразилія\nСтолиця: Бразілія\nЧисельність населення: ~213 мільйонів\n";
            break;
        case 'C':
            cout << "Канада\nСтолиця: Оттава\nЧисельність населення: ~38 мільйонів\n";
            break;
        case 'D':
            cout << "Данія\nСтолиця: Копенгаген\nЧисельність населення: ~5,8 мільйонів\n";
            break;
        case 'E':
            cout << "Єгипет\nСтолиця: Каїр\nЧисельність населення: ~102 мільйони\n";
            break;
        case 'F':
            cout << "Франція\nСтолиця: Париж\nЧисельність населення: ~67 мільйонів\n";
            break;
        case 'G':
            cout << "Німеччина (Germany)\nСтолиця: Берлін\nЧисельність населення: ~83 мільйони\n";
            break;
        default:
            cout << "Країна з такою першою літерою не знайдена у нашому списку.\n";
            break;
    }

    return 0;
}
